In [1]:
import numpy as np
import pandas as pd

pd.set_option("display.max.columns", 100)
# to draw pictures in jupyter notebook
%matplotlib inline
# we don't like warnings
# you can comment the following 2 lines if you'd like to
import warnings

import matplotlib.pyplot as plt
import seaborn as sns

warnings.filterwarnings("ignore")

In [2]:
# for Jupyter-book, we copy data from GitHub, locally, to save Internet traffic,
# you can specify the data/ folder from the root of your cloned
# https://github.com/Yorko/mlcourse.ai repo, to save Internet traffic
DATA_URL = "https://raw.githubusercontent.com/Yorko/mlcourse.ai/master/data/"

In [3]:
data = pd.read_csv(DATA_URL + "adult.data.csv")
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

### 1. How many men and women (sex feature) are represented in this dataset?

In [8]:
data["sex"].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

### 2. What is the average age (age feature) of women?

In [9]:
data[data.sex=="Female"]["age"].mean()

36.85823043357163

### 3. What is the percentage of German citizens (native-country feature)?

In [30]:
float((data["native-country"] == "Germany").sum()) * 100 / data.shape[0]

0.42074874850281013

In [27]:
data.shape[0]

32561

In [28]:
data["native-country"].value_counts()

United-States                 29170
Mexico                          643
?                               583
Philippines                     198
Germany                         137
Canada                          121
Puerto-Rico                     114
El-Salvador                     106
India                           100
Cuba                             95
England                          90
Jamaica                          81
South                            80
China                            75
Italy                            73
Dominican-Republic               70
Vietnam                          67
Guatemala                        64
Japan                            62
Poland                           60
Columbia                         59
Taiwan                           51
Haiti                            44
Iran                             43
Portugal                         37
Nicaragua                        34
Peru                             31
France                           29
Greece                           29
Ecuador                          28
Ireland                          24
Hong                             20
Cambodia                         19
Trinadad&Tobago                  19
Laos                             18
Thailand                         18
Yugoslavia                       16
Outlying-US(Guam-USVI-etc)       14
Honduras                         13
Hungary                          13
Scotland                         12
Holand-Netherlands                1
Name: native-country, dtype: int64

In [31]:
test = pd.read_csv("shmya_final_version.csv")

In [32]:
test

                      date  cutlery  tips  order_price     uid  order_id
0      2022-01-17 06:38:43        3   100         1001  120967  73041443
1      2022-01-23 11:09:22        4   110          309  325757  60500835
2      2022-01-24 19:40:03        1    10          891  986730  43230531
3      2022-01-14 18:01:22        5    70          749  868648  46180789
4      2022-01-19 22:32:43        2    10          469  863523  59266169
...                    ...      ...   ...          ...     ...       ...
26052  2022-01-04 05:21:39        4    10          763  182587  85041983
26053  2022-01-18 14:43:12        3    60          790  187031  47894568
26054  2022-01-26 18:08:02        1    90          502  247419  75350869
26055  2022-01-18 05:55:09        2    80          418  474601  79438423
26056  2022-01-09 01:06:30        2    50          802  898956  87138202

[26057 rows x 6 columns]

In [46]:
test[(test["order_price"]!=0) & (test["cutlery"]>2)]["tips"].mean()

78.87790616733955

In [48]:
test[(test["order_price"]!=0) & (test["cutlery"]<=2)]["tips"].mean()

51.55533176681213

In [36]:
test[test["cutlery"]>2].order_price.min()

0

In [45]:
test[(test["order_price"]!=0) & (test["cutlery"]>2)].order_price.min()

254

In [50]:
test[(test["order_price"]!=0) & (test["cutlery"]<=2)].order_price.max()

1044

In [52]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26057 entries, 0 to 26056
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         26057 non-null  object
 1   cutlery      26057 non-null  int64
 2   tips         26057 non-null  int64
 3   order_price  26057 non-null  int64
 4   uid          26057 non-null  int64
 5   order_id     26057 non-null  int64
dtypes: int64(5), object(1)
memory usage: 1.2+ MB

In [54]:
from datetime import datetime

In [76]:
testt = test.query("date < '2022-01-09'")

In [75]:
testt.uid.count()

17221

In [74]:
testt[(testt["order_price"]>800)&(test["cutlery"]>2)].uid

0        120967
18       255228
23       781632
46       638996
52       686259
          ...
26027    739019
26033    540487
26034    117066
26038    958020
26043    908699
Name: uid, Length: 3529, dtype: int64

In [73]:
testt[(testt["order_price"]>800)&(test["cutlery"]>2)].uid.count()

3529